7767517
191 215
Input                    in0                      0 1 in0
Convolution              conv_69                  1 1 in0 1 0=16 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1728
HardSwish                hswish_0                 1 1 1 2 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_128               1 1 2 3 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16
Convolution              conv_70                  1 1 3 4 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_1                 1 1 4 5 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_0              1 2 5 6 7
ConvolutionDepthWise     convdw_129               1 1 7 8 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_71                  1 1 8 9 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_2                 1 1 9 10 0=1.666667e-01 1=5.000000e-01
Convolution              conv_72                  1 1 6 11 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_3                 1 1 11 12 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_130               1 1 12 13 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16
Convolution              conv_73                  1 1 13 14 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
HardSwish                hswish_4                 1 1 14 15 0=1.666667e-01 1=5.000000e-01
Concat                   cat_0                    2 1 10 15 16 0=0
ShuffleChannel           channelshuffle_60        1 1 16 17 0=2 1=0
Slice                    tensor_split_0           1 2 17 18 19 -23300=2,32,-233 1=0
Convolution              conv_74                  1 1 19 20 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_5                 1 1 20 21 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_131               1 1 21 22 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              conv_75                  1 1 22 23 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_6                 1 1 23 24 0=1.666667e-01 1=5.000000e-01
Concat                   cat_1                    2 1 18 24 25 0=0
ShuffleChannel           channelshuffle_61        1 1 25 26 0=2 1=0
Slice                    tensor_split_1           1 2 26 27 28 -23300=2,32,-233 1=0
Convolution              conv_76                  1 1 28 29 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_7                 1 1 29 30 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_132               1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              conv_77                  1 1 31 32 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_8                 1 1 32 33 0=1.666667e-01 1=5.000000e-01
Concat                   cat_2                    2 1 27 33 34 0=0
ShuffleChannel           channelshuffle_62        1 1 34 35 0=2 1=0
Split                    splitncnn_1              1 4 35 36 37 38 39
ConvolutionDepthWise     convdw_133               1 1 39 40 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
Convolution              conv_78                  1 1 40 41 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
HardSwish                hswish_9                 1 1 41 42 0=1.666667e-01 1=5.000000e-01
Convolution              conv_79                  1 1 37 43 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
HardSwish                hswish_10                1 1 43 44 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_134               1 1 44 45 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_80                  1 1 45 46 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
HardSwish                hswish_11                1 1 46 47 0=1.666667e-01 1=5.000000e-01
Concat                   cat_3                    2 1 42 47 48 0=0
ShuffleChannel           channelshuffle_63        1 1 48 49 0=2 1=0
Slice                    tensor_split_2           1 2 49 50 51 -23300=2,64,-233 1=0
Convolution              conv_81                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_12                1 1 52 53 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_135               1 1 53 54 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_82                  1 1 54 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_13                1 1 55 56 0=1.666667e-01 1=5.000000e-01
Concat                   cat_4                    2 1 50 56 57 0=0
ShuffleChannel           channelshuffle_64        1 1 57 58 0=2 1=0
Slice                    tensor_split_3           1 2 58 59 60 -23300=2,64,-233 1=0
Convolution              conv_83                  1 1 60 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_14                1 1 61 62 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_136               1 1 62 63 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_84                  1 1 63 64 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_15                1 1 64 65 0=1.666667e-01 1=5.000000e-01
Concat                   cat_5                    2 1 59 65 66 0=0
ShuffleChannel           channelshuffle_65        1 1 66 67 0=2 1=0
Split                    splitncnn_2              1 3 67 68 69 70
ConvolutionDepthWise     convdw_137               1 1 70 71 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Convolution              conv_85                  1 1 71 72 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_16                1 1 72 73 0=1.666667e-01 1=5.000000e-01
Convolution              conv_86                  1 1 69 74 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_17                1 1 74 75 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_138               1 1 75 76 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
Convolution              conv_87                  1 1 76 77 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
HardSwish                hswish_18                1 1 77 78 0=1.666667e-01 1=5.000000e-01
Concat                   cat_6                    2 1 73 78 79 0=0
ShuffleChannel           channelshuffle_66        1 1 79 80 0=2 1=0
Slice                    tensor_split_4           1 2 80 81 82 -23300=2,128,-233 1=0
Convolution              conv_88                  1 1 82 83 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_19                1 1 83 84 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_139               1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_89                  1 1 85 86 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_20                1 1 86 87 0=1.666667e-01 1=5.000000e-01
Concat                   cat_7                    2 1 81 87 88 0=0
ShuffleChannel           channelshuffle_67        1 1 88 89 0=2 1=0
Slice                    tensor_split_5           1 2 89 90 91 -23300=2,128,-233 1=0
Convolution              conv_90                  1 1 91 92 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_21                1 1 92 93 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_140               1 1 93 94 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_91                  1 1 94 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_22                1 1 95 96 0=1.666667e-01 1=5.000000e-01
Concat                   cat_8                    2 1 90 96 97 0=0
ShuffleChannel           channelshuffle_68        1 1 97 98 0=2 1=0
Convolution              conv_92                  1 1 98 99 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_23                1 1 99 100 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_3              1 2 100 101 102
Convolution              conv_93                  1 1 102 103 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_24                1 1 103 104 0=1.666667e-01 1=5.000000e-01
Interp                   interpolate_52           1 1 104 105 0=1 1=2.000000e+00 2=2.000000e+00 6=0
ConvolutionDepthWise     convdw_141               1 1 38 106 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
Convolution              conv_94                  1 1 106 107 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_25                1 1 107 108 0=1.666667e-01 1=5.000000e-01
Concat                   cat_9                    3 1 108 68 105 109 0=0
Split                    splitncnn_4              1 2 109 110 111
Convolution              conv_95                  1 1 111 112 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_26                1 1 112 113 0=1.666667e-01 1=5.000000e-01
Convolution              conv_96                  1 1 110 114 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_27                1 1 114 115 0=1.666667e-01 1=5.000000e-01
Convolution              conv_97                  1 1 113 116 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_28                1 1 116 117 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_142               1 1 117 118 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_98                  1 1 118 119 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_29                1 1 119 120 0=1.666667e-01 1=5.000000e-01
Concat                   cat_10                   2 1 120 115 121 0=0
Convolution              conv_99                  1 1 121 122 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_30                1 1 122 123 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_5              1 3 123 124 125 126
Convolution              conv_100                 1 1 125 127 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_31                1 1 127 128 0=1.666667e-01 1=5.000000e-01
Interp                   interpolate_53           1 1 128 129 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   2 1 36 129 130 0=0
Split                    splitncnn_6              1 2 130 131 132
Convolution              conv_101                 1 1 132 133 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_32                1 1 133 134 0=1.666667e-01 1=5.000000e-01
Convolution              conv_102                 1 1 131 135 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_33                1 1 135 136 0=1.666667e-01 1=5.000000e-01
Convolution              conv_103                 1 1 134 137 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_34                1 1 137 138 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_143               1 1 138 139 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              conv_104                 1 1 139 140 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_35                1 1 140 141 0=1.666667e-01 1=5.000000e-01
Concat                   cat_12                   2 1 141 136 142 0=0
Convolution              conv_105                 1 1 142 143 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_36                1 1 143 144 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_144               1 1 126 145 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Convolution              conv_106                 1 1 145 146 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_37                1 1 146 147 0=1.666667e-01 1=5.000000e-01
Concat                   cat_13                   2 1 147 101 148 0=0
Split                    splitncnn_7              1 2 148 149 150
Convolution              conv_107                 1 1 150 151 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_38                1 1 151 152 0=1.666667e-01 1=5.000000e-01
Convolution              conv_108                 1 1 149 153 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_39                1 1 153 154 0=1.666667e-01 1=5.000000e-01
Convolution              conv_109                 1 1 152 155 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_40                1 1 155 156 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_145               1 1 156 157 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_110                 1 1 157 158 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_41                1 1 158 159 0=1.666667e-01 1=5.000000e-01
Concat                   cat_14                   2 1 159 154 160 0=0
Convolution              conv_111                 1 1 160 161 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_42                1 1 161 162 0=1.666667e-01 1=5.000000e-01
Convolution              conv_112                 1 1 144 163 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_43                1 1 163 164 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_146               1 1 164 165 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
ConvolutionDepthWise     convdw_147               1 1 165 166 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 7=2
HardSwish                hswish_44                1 1 166 167 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_148               1 1 167 168 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
ConvolutionDepthWise     convdw_149               1 1 168 169 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 7=2
HardSwish                hswish_45                1 1 169 170 0=1.666667e-01 1=5.000000e-01
Slice                    tensor_split_6           1 2 170 171 172 -23300=2,64,-233 1=0
Split                    splitncnn_8              1 2 171 173 174
Convolution              conv_114                 1 1 174 175 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convsigmoid_0            1 1 173 176 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Convolution              convsigmoid_1            1 1 172 177 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768 9=4
Concat                   cat_15                   3 1 175 176 177 178 0=0
Convolution              conv_116                 1 1 124 179 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_46                1 1 179 180 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_150               1 1 180 181 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
ConvolutionDepthWise     convdw_151               1 1 181 182 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 7=2
HardSwish                hswish_47                1 1 182 183 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_152               1 1 183 184 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
ConvolutionDepthWise     convdw_153               1 1 184 185 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 7=2
HardSwish                hswish_48                1 1 185 186 0=1.666667e-01 1=5.000000e-01
Slice                    tensor_split_7           1 2 186 187 188 -23300=2,64,-233 1=0
Split                    splitncnn_9              1 2 187 189 190
Convolution              conv_118                 1 1 190 191 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convsigmoid_2            1 1 189 192 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Convolution              convsigmoid_3            1 1 188 193 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768 9=4
Concat                   cat_16                   3 1 191 192 193 194 0=0
Convolution              conv_120                 1 1 162 195 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_49                1 1 195 196 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_154               1 1 196 197 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
ConvolutionDepthWise     convdw_155               1 1 197 198 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 7=2
HardSwish                hswish_50                1 1 198 199 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_156               1 1 199 200 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
ConvolutionDepthWise     convdw_157               1 1 200 201 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 7=2
HardSwish                hswish_51                1 1 201 202 0=1.666667e-01 1=5.000000e-01
Slice                    tensor_split_8           1 2 202 203 204 -23300=2,64,-233 1=0
Split                    splitncnn_10             1 2 203 205 206
Convolution              conv_122                 1 1 206 207 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convsigmoid_4            1 1 205 208 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Convolution              convsigmoid_5            1 1 204 209 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768 9=4
Concat                   cat_17                   3 1 207 208 209 210 0=0
Reshape                  reshape_125              1 1 178 211 0=2704 1=21
Reshape                  reshape_126              1 1 194 212 0=676 1=21
Reshape                  reshape_127              1 1 210 213 0=169 1=21
Concat                   cat_18                   3 1 211 212 213 out0 0=1
