7767517
344 410
Input            images                   0 1 images
Convolution      /backbone/embedding/conv/Conv 1 1 images /backbone/embedding/conv/Conv_output_0 0=40 1=4 11=4 2=1 12=1 3=4 13=4 4=0 14=0 15=0 16=0 5=1 6=1920
ReLU             /backbone/embedding/act/Relu 1 1 /backbone/embedding/conv/Conv_output_0 /backbone/embedding/act/Relu_output_0
Split            splitncnn_0              1 2 /backbone/embedding/act/Relu_output_0 /backbone/embedding/act/Relu_output_0_splitncnn_0 /backbone/embedding/act/Relu_output_0_splitncnn_1
Slice            /backbone/stage1/block0/conv1/Split 1 2 /backbone/embedding/act/Relu_output_0_splitncnn_1 /backbone/stage1/block0/conv1/Split_output_0 /backbone/stage1/block0/conv1/Split_output_1 -23300=2,10,-233 1=0
Convolution      /backbone/stage1/block0/conv1/conv/Conv 1 1 /backbone/stage1/block0/conv1/Split_output_0 /backbone/stage1/block0/conv1/conv/Conv_output_0 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=900
Concat           /backbone/stage1/block0/conv1/Concat 2 1 /backbone/stage1/block0/conv1/conv/Conv_output_0 /backbone/stage1/block0/conv1/Split_output_1 /backbone/stage1/block0/conv1/Concat_output_0 0=0
Convolution      /backbone/stage1/block0/conv2/conv/Conv 1 1 /backbone/stage1/block0/conv1/Concat_output_0 /backbone/stage1/block0/conv2/conv/Conv_output_0 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3200
Split            splitncnn_1              1 2 /backbone/stage1/block0/conv2/conv/Conv_output_0 /backbone/stage1/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage1/block0/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage1/block0/conv2/act/Div 1 1 /backbone/stage1/block0/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage1/block0/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage1/block0/conv2/act/Erf 1 1 /backbone/stage1/block0/conv2/act/Div_output_0 /backbone/stage1/block0/conv2/act/Erf_output_0
BinaryOp         /backbone/stage1/block0/conv2/act/Add 1 1 /backbone/stage1/block0/conv2/act/Erf_output_0 /backbone/stage1/block0/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage1/block0/conv2/act/Mul 2 1 /backbone/stage1/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage1/block0/conv2/act/Add_output_0 /backbone/stage1/block0/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage1/block0/conv2/act/Mul_1 1 1 /backbone/stage1/block0/conv2/act/Mul_output_0 /backbone/stage1/block0/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage1/block0/conv3/Conv 1 1 /backbone/stage1/block0/conv2/act/Mul_1_output_0 /backbone/stage1/block0/conv3/Conv_output_0 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3200
BinaryOp         /backbone/stage1/block0/Add 2 1 /backbone/embedding/act/Relu_output_0_splitncnn_0 /backbone/stage1/block0/conv3/Conv_output_0 /backbone/stage1/block0/Add_output_0 0=0
Convolution      /backbone/merging1/conv/Conv 1 1 /backbone/stage1/block0/Add_output_0 /backbone/merging1/conv/Conv_output_0 0=80 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=12800
ReLU             /backbone/merging1/act/Relu 1 1 /backbone/merging1/conv/Conv_output_0 /backbone/merging1/act/Relu_output_0
Split            splitncnn_2              1 2 /backbone/merging1/act/Relu_output_0 /backbone/merging1/act/Relu_output_0_splitncnn_0 /backbone/merging1/act/Relu_output_0_splitncnn_1
Pooling          /backbone/se1/globalavgpool/GlobalAveragePool 1 1 /backbone/merging1/act/Relu_output_0_splitncnn_1 /backbone/se1/globalavgpool/GlobalAveragePool_output_0 0=1 4=1
Reshape          /backbone/se1/Reshape    1 1 /backbone/se1/globalavgpool/GlobalAveragePool_output_0 /backbone/se1/Reshape_output_0 0=80
InnerProduct     /backbone/se1/fc/fc.0/Gemm 1 1 /backbone/se1/Reshape_output_0 /backbone/se1/fc/fc.0/Gemm_output_0 0=5 1=1 2=400
ReLU             /backbone/se1/fc/fc.1/Relu 1 1 /backbone/se1/fc/fc.0/Gemm_output_0 /backbone/se1/fc/fc.1/Relu_output_0
InnerProduct     /backbone/se1/fc/fc.2/Gemm 1 1 /backbone/se1/fc/fc.1/Relu_output_0 /backbone/se1/fc/fc.2/Gemm_output_0 0=80 1=1 2=400
Sigmoid          /backbone/se1/fc/fc.3/Sigmoid 1 1 /backbone/se1/fc/fc.2/Gemm_output_0 /backbone/se1/fc/fc.3/Sigmoid_output_0
Reshape          /backbone/se1/Reshape_1  1 1 /backbone/se1/fc/fc.3/Sigmoid_output_0 /backbone/se1/Reshape_1_output_0 0=1 1=1 2=80
BinaryOp         /backbone/se1/Mul        2 1 /backbone/merging1/act/Relu_output_0_splitncnn_0 /backbone/se1/Reshape_1_output_0 /backbone/se1/Mul_output_0 0=2
Split            splitncnn_3              1 2 /backbone/se1/Mul_output_0 /backbone/se1/Mul_output_0_splitncnn_0 /backbone/se1/Mul_output_0_splitncnn_1
Slice            /backbone/stage2/block0/conv1/Split 1 2 /backbone/se1/Mul_output_0_splitncnn_1 /backbone/stage2/block0/conv1/Split_output_0 /backbone/stage2/block0/conv1/Split_output_1 -23300=2,20,-233 1=0
Convolution      /backbone/stage2/block0/conv1/conv/Conv 1 1 /backbone/stage2/block0/conv1/Split_output_0 /backbone/stage2/block0/conv1/conv/Conv_output_0 0=20 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3600
Concat           /backbone/stage2/block0/conv1/Concat 2 1 /backbone/stage2/block0/conv1/conv/Conv_output_0 /backbone/stage2/block0/conv1/Split_output_1 /backbone/stage2/block0/conv1/Concat_output_0 0=0
Convolution      /backbone/stage2/block0/conv2/conv/Conv 1 1 /backbone/stage2/block0/conv1/Concat_output_0 /backbone/stage2/block0/conv2/conv/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
Split            splitncnn_4              1 2 /backbone/stage2/block0/conv2/conv/Conv_output_0 /backbone/stage2/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage2/block0/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage2/block0/conv2/act/Div 1 1 /backbone/stage2/block0/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage2/block0/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage2/block0/conv2/act/Erf 1 1 /backbone/stage2/block0/conv2/act/Div_output_0 /backbone/stage2/block0/conv2/act/Erf_output_0
BinaryOp         /backbone/stage2/block0/conv2/act/Add 1 1 /backbone/stage2/block0/conv2/act/Erf_output_0 /backbone/stage2/block0/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage2/block0/conv2/act/Mul 2 1 /backbone/stage2/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage2/block0/conv2/act/Add_output_0 /backbone/stage2/block0/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage2/block0/conv2/act/Mul_1 1 1 /backbone/stage2/block0/conv2/act/Mul_output_0 /backbone/stage2/block0/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage2/block0/conv3/Conv 1 1 /backbone/stage2/block0/conv2/act/Mul_1_output_0 /backbone/stage2/block0/conv3/Conv_output_0 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12800
BinaryOp         /backbone/stage2/block0/Add 2 1 /backbone/se1/Mul_output_0_splitncnn_0 /backbone/stage2/block0/conv3/Conv_output_0 /backbone/stage2/block0/Add_output_0 0=0
Split            splitncnn_5              1 2 /backbone/stage2/block0/Add_output_0 /backbone/stage2/block0/Add_output_0_splitncnn_0 /backbone/stage2/block0/Add_output_0_splitncnn_1
Slice            /backbone/stage2/block1/conv1/Split 1 2 /backbone/stage2/block0/Add_output_0_splitncnn_1 /backbone/stage2/block1/conv1/Split_output_0 /backbone/stage2/block1/conv1/Split_output_1 -23300=2,20,-233 1=0
Convolution      /backbone/stage2/block1/conv1/conv/Conv 1 1 /backbone/stage2/block1/conv1/Split_output_0 /backbone/stage2/block1/conv1/conv/Conv_output_0 0=20 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3600
Concat           /backbone/stage2/block1/conv1/Concat 2 1 /backbone/stage2/block1/conv1/conv/Conv_output_0 /backbone/stage2/block1/conv1/Split_output_1 /backbone/stage2/block1/conv1/Concat_output_0 0=0
Convolution      /backbone/stage2/block1/conv2/conv/Conv 1 1 /backbone/stage2/block1/conv1/Concat_output_0 /backbone/stage2/block1/conv2/conv/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
Split            splitncnn_6              1 2 /backbone/stage2/block1/conv2/conv/Conv_output_0 /backbone/stage2/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage2/block1/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage2/block1/conv2/act/Div 1 1 /backbone/stage2/block1/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage2/block1/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage2/block1/conv2/act/Erf 1 1 /backbone/stage2/block1/conv2/act/Div_output_0 /backbone/stage2/block1/conv2/act/Erf_output_0
BinaryOp         /backbone/stage2/block1/conv2/act/Add 1 1 /backbone/stage2/block1/conv2/act/Erf_output_0 /backbone/stage2/block1/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage2/block1/conv2/act/Mul 2 1 /backbone/stage2/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage2/block1/conv2/act/Add_output_0 /backbone/stage2/block1/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage2/block1/conv2/act/Mul_1 1 1 /backbone/stage2/block1/conv2/act/Mul_output_0 /backbone/stage2/block1/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage2/block1/conv3/Conv 1 1 /backbone/stage2/block1/conv2/act/Mul_1_output_0 /backbone/stage2/block1/conv3/Conv_output_0 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12800
BinaryOp         /backbone/stage2/block1/Add 2 1 /backbone/stage2/block0/Add_output_0_splitncnn_0 /backbone/stage2/block1/conv3/Conv_output_0 /backbone/stage2/block1/Add_output_0 0=0
Split            splitncnn_7              1 2 /backbone/stage2/block1/Add_output_0 /backbone/stage2/block1/Add_output_0_splitncnn_0 /backbone/stage2/block1/Add_output_0_splitncnn_1
Convolution      /backbone/merging2/conv/Conv 1 1 /backbone/stage2/block1/Add_output_0_splitncnn_1 /backbone/merging2/conv/Conv_output_0 0=160 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=51200
ReLU             /backbone/merging2/act/Relu 1 1 /backbone/merging2/conv/Conv_output_0 /backbone/merging2/act/Relu_output_0
Split            splitncnn_8              1 2 /backbone/merging2/act/Relu_output_0 /backbone/merging2/act/Relu_output_0_splitncnn_0 /backbone/merging2/act/Relu_output_0_splitncnn_1
Pooling          /backbone/se2/globalavgpool/GlobalAveragePool 1 1 /backbone/merging2/act/Relu_output_0_splitncnn_1 /backbone/se2/globalavgpool/GlobalAveragePool_output_0 0=1 4=1
Reshape          /backbone/se2/Reshape    1 1 /backbone/se2/globalavgpool/GlobalAveragePool_output_0 /backbone/se2/Reshape_output_0 0=160
InnerProduct     /backbone/se2/fc/fc.0/Gemm 1 1 /backbone/se2/Reshape_output_0 /backbone/se2/fc/fc.0/Gemm_output_0 0=10 1=1 2=1600
ReLU             /backbone/se2/fc/fc.1/Relu 1 1 /backbone/se2/fc/fc.0/Gemm_output_0 /backbone/se2/fc/fc.1/Relu_output_0
InnerProduct     /backbone/se2/fc/fc.2/Gemm 1 1 /backbone/se2/fc/fc.1/Relu_output_0 /backbone/se2/fc/fc.2/Gemm_output_0 0=160 1=1 2=1600
Sigmoid          /backbone/se2/fc/fc.3/Sigmoid 1 1 /backbone/se2/fc/fc.2/Gemm_output_0 /backbone/se2/fc/fc.3/Sigmoid_output_0
Reshape          /backbone/se2/Reshape_1  1 1 /backbone/se2/fc/fc.3/Sigmoid_output_0 /backbone/se2/Reshape_1_output_0 0=1 1=1 2=160
BinaryOp         /backbone/se2/Mul        2 1 /backbone/merging2/act/Relu_output_0_splitncnn_0 /backbone/se2/Reshape_1_output_0 /backbone/se2/Mul_output_0 0=2
Split            splitncnn_9              1 2 /backbone/se2/Mul_output_0 /backbone/se2/Mul_output_0_splitncnn_0 /backbone/se2/Mul_output_0_splitncnn_1
Slice            /backbone/stage3/block0/conv1/Split 1 2 /backbone/se2/Mul_output_0_splitncnn_1 /backbone/stage3/block0/conv1/Split_output_0 /backbone/stage3/block0/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block0/conv1/conv/Conv 1 1 /backbone/stage3/block0/conv1/Split_output_0 /backbone/stage3/block0/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block0/conv1/Concat 2 1 /backbone/stage3/block0/conv1/conv/Conv_output_0 /backbone/stage3/block0/conv1/Split_output_1 /backbone/stage3/block0/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block0/conv2/conv/Conv 1 1 /backbone/stage3/block0/conv1/Concat_output_0 /backbone/stage3/block0/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_10             1 2 /backbone/stage3/block0/conv2/conv/Conv_output_0 /backbone/stage3/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block0/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block0/conv2/act/Div 1 1 /backbone/stage3/block0/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block0/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block0/conv2/act/Erf 1 1 /backbone/stage3/block0/conv2/act/Div_output_0 /backbone/stage3/block0/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block0/conv2/act/Add 1 1 /backbone/stage3/block0/conv2/act/Erf_output_0 /backbone/stage3/block0/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block0/conv2/act/Mul 2 1 /backbone/stage3/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block0/conv2/act/Add_output_0 /backbone/stage3/block0/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block0/conv2/act/Mul_1 1 1 /backbone/stage3/block0/conv2/act/Mul_output_0 /backbone/stage3/block0/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block0/conv3/Conv 1 1 /backbone/stage3/block0/conv2/act/Mul_1_output_0 /backbone/stage3/block0/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block0/Add 2 1 /backbone/se2/Mul_output_0_splitncnn_0 /backbone/stage3/block0/conv3/Conv_output_0 /backbone/stage3/block0/Add_output_0 0=0
Split            splitncnn_11             1 2 /backbone/stage3/block0/Add_output_0 /backbone/stage3/block0/Add_output_0_splitncnn_0 /backbone/stage3/block0/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block1/conv1/Split 1 2 /backbone/stage3/block0/Add_output_0_splitncnn_1 /backbone/stage3/block1/conv1/Split_output_0 /backbone/stage3/block1/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block1/conv1/conv/Conv 1 1 /backbone/stage3/block1/conv1/Split_output_0 /backbone/stage3/block1/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block1/conv1/Concat 2 1 /backbone/stage3/block1/conv1/conv/Conv_output_0 /backbone/stage3/block1/conv1/Split_output_1 /backbone/stage3/block1/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block1/conv2/conv/Conv 1 1 /backbone/stage3/block1/conv1/Concat_output_0 /backbone/stage3/block1/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_12             1 2 /backbone/stage3/block1/conv2/conv/Conv_output_0 /backbone/stage3/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block1/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block1/conv2/act/Div 1 1 /backbone/stage3/block1/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block1/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block1/conv2/act/Erf 1 1 /backbone/stage3/block1/conv2/act/Div_output_0 /backbone/stage3/block1/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block1/conv2/act/Add 1 1 /backbone/stage3/block1/conv2/act/Erf_output_0 /backbone/stage3/block1/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block1/conv2/act/Mul 2 1 /backbone/stage3/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block1/conv2/act/Add_output_0 /backbone/stage3/block1/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block1/conv2/act/Mul_1 1 1 /backbone/stage3/block1/conv2/act/Mul_output_0 /backbone/stage3/block1/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block1/conv3/Conv 1 1 /backbone/stage3/block1/conv2/act/Mul_1_output_0 /backbone/stage3/block1/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block1/Add 2 1 /backbone/stage3/block0/Add_output_0_splitncnn_0 /backbone/stage3/block1/conv3/Conv_output_0 /backbone/stage3/block1/Add_output_0 0=0
Split            splitncnn_13             1 2 /backbone/stage3/block1/Add_output_0 /backbone/stage3/block1/Add_output_0_splitncnn_0 /backbone/stage3/block1/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block2/conv1/Split 1 2 /backbone/stage3/block1/Add_output_0_splitncnn_1 /backbone/stage3/block2/conv1/Split_output_0 /backbone/stage3/block2/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block2/conv1/conv/Conv 1 1 /backbone/stage3/block2/conv1/Split_output_0 /backbone/stage3/block2/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block2/conv1/Concat 2 1 /backbone/stage3/block2/conv1/conv/Conv_output_0 /backbone/stage3/block2/conv1/Split_output_1 /backbone/stage3/block2/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block2/conv2/conv/Conv 1 1 /backbone/stage3/block2/conv1/Concat_output_0 /backbone/stage3/block2/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_14             1 2 /backbone/stage3/block2/conv2/conv/Conv_output_0 /backbone/stage3/block2/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block2/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block2/conv2/act/Div 1 1 /backbone/stage3/block2/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block2/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block2/conv2/act/Erf 1 1 /backbone/stage3/block2/conv2/act/Div_output_0 /backbone/stage3/block2/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block2/conv2/act/Add 1 1 /backbone/stage3/block2/conv2/act/Erf_output_0 /backbone/stage3/block2/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block2/conv2/act/Mul 2 1 /backbone/stage3/block2/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block2/conv2/act/Add_output_0 /backbone/stage3/block2/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block2/conv2/act/Mul_1 1 1 /backbone/stage3/block2/conv2/act/Mul_output_0 /backbone/stage3/block2/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block2/conv3/Conv 1 1 /backbone/stage3/block2/conv2/act/Mul_1_output_0 /backbone/stage3/block2/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block2/Add 2 1 /backbone/stage3/block1/Add_output_0_splitncnn_0 /backbone/stage3/block2/conv3/Conv_output_0 /backbone/stage3/block2/Add_output_0 0=0
Split            splitncnn_15             1 2 /backbone/stage3/block2/Add_output_0 /backbone/stage3/block2/Add_output_0_splitncnn_0 /backbone/stage3/block2/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block3/conv1/Split 1 2 /backbone/stage3/block2/Add_output_0_splitncnn_1 /backbone/stage3/block3/conv1/Split_output_0 /backbone/stage3/block3/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block3/conv1/conv/Conv 1 1 /backbone/stage3/block3/conv1/Split_output_0 /backbone/stage3/block3/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block3/conv1/Concat 2 1 /backbone/stage3/block3/conv1/conv/Conv_output_0 /backbone/stage3/block3/conv1/Split_output_1 /backbone/stage3/block3/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block3/conv2/conv/Conv 1 1 /backbone/stage3/block3/conv1/Concat_output_0 /backbone/stage3/block3/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_16             1 2 /backbone/stage3/block3/conv2/conv/Conv_output_0 /backbone/stage3/block3/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block3/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block3/conv2/act/Div 1 1 /backbone/stage3/block3/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block3/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block3/conv2/act/Erf 1 1 /backbone/stage3/block3/conv2/act/Div_output_0 /backbone/stage3/block3/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block3/conv2/act/Add 1 1 /backbone/stage3/block3/conv2/act/Erf_output_0 /backbone/stage3/block3/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block3/conv2/act/Mul 2 1 /backbone/stage3/block3/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block3/conv2/act/Add_output_0 /backbone/stage3/block3/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block3/conv2/act/Mul_1 1 1 /backbone/stage3/block3/conv2/act/Mul_output_0 /backbone/stage3/block3/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block3/conv3/Conv 1 1 /backbone/stage3/block3/conv2/act/Mul_1_output_0 /backbone/stage3/block3/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block3/Add 2 1 /backbone/stage3/block2/Add_output_0_splitncnn_0 /backbone/stage3/block3/conv3/Conv_output_0 /backbone/stage3/block3/Add_output_0 0=0
Split            splitncnn_17             1 2 /backbone/stage3/block3/Add_output_0 /backbone/stage3/block3/Add_output_0_splitncnn_0 /backbone/stage3/block3/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block4/conv1/Split 1 2 /backbone/stage3/block3/Add_output_0_splitncnn_1 /backbone/stage3/block4/conv1/Split_output_0 /backbone/stage3/block4/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block4/conv1/conv/Conv 1 1 /backbone/stage3/block4/conv1/Split_output_0 /backbone/stage3/block4/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block4/conv1/Concat 2 1 /backbone/stage3/block4/conv1/conv/Conv_output_0 /backbone/stage3/block4/conv1/Split_output_1 /backbone/stage3/block4/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block4/conv2/conv/Conv 1 1 /backbone/stage3/block4/conv1/Concat_output_0 /backbone/stage3/block4/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_18             1 2 /backbone/stage3/block4/conv2/conv/Conv_output_0 /backbone/stage3/block4/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block4/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block4/conv2/act/Div 1 1 /backbone/stage3/block4/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block4/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block4/conv2/act/Erf 1 1 /backbone/stage3/block4/conv2/act/Div_output_0 /backbone/stage3/block4/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block4/conv2/act/Add 1 1 /backbone/stage3/block4/conv2/act/Erf_output_0 /backbone/stage3/block4/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block4/conv2/act/Mul 2 1 /backbone/stage3/block4/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block4/conv2/act/Add_output_0 /backbone/stage3/block4/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block4/conv2/act/Mul_1 1 1 /backbone/stage3/block4/conv2/act/Mul_output_0 /backbone/stage3/block4/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block4/conv3/Conv 1 1 /backbone/stage3/block4/conv2/act/Mul_1_output_0 /backbone/stage3/block4/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block4/Add 2 1 /backbone/stage3/block3/Add_output_0_splitncnn_0 /backbone/stage3/block4/conv3/Conv_output_0 /backbone/stage3/block4/Add_output_0 0=0
Split            splitncnn_19             1 2 /backbone/stage3/block4/Add_output_0 /backbone/stage3/block4/Add_output_0_splitncnn_0 /backbone/stage3/block4/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block5/conv1/Split 1 2 /backbone/stage3/block4/Add_output_0_splitncnn_1 /backbone/stage3/block5/conv1/Split_output_0 /backbone/stage3/block5/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block5/conv1/conv/Conv 1 1 /backbone/stage3/block5/conv1/Split_output_0 /backbone/stage3/block5/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block5/conv1/Concat 2 1 /backbone/stage3/block5/conv1/conv/Conv_output_0 /backbone/stage3/block5/conv1/Split_output_1 /backbone/stage3/block5/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block5/conv2/conv/Conv 1 1 /backbone/stage3/block5/conv1/Concat_output_0 /backbone/stage3/block5/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_20             1 2 /backbone/stage3/block5/conv2/conv/Conv_output_0 /backbone/stage3/block5/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block5/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block5/conv2/act/Div 1 1 /backbone/stage3/block5/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block5/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block5/conv2/act/Erf 1 1 /backbone/stage3/block5/conv2/act/Div_output_0 /backbone/stage3/block5/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block5/conv2/act/Add 1 1 /backbone/stage3/block5/conv2/act/Erf_output_0 /backbone/stage3/block5/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block5/conv2/act/Mul 2 1 /backbone/stage3/block5/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block5/conv2/act/Add_output_0 /backbone/stage3/block5/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block5/conv2/act/Mul_1 1 1 /backbone/stage3/block5/conv2/act/Mul_output_0 /backbone/stage3/block5/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block5/conv3/Conv 1 1 /backbone/stage3/block5/conv2/act/Mul_1_output_0 /backbone/stage3/block5/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block5/Add 2 1 /backbone/stage3/block4/Add_output_0_splitncnn_0 /backbone/stage3/block5/conv3/Conv_output_0 /backbone/stage3/block5/Add_output_0 0=0
Split            splitncnn_21             1 2 /backbone/stage3/block5/Add_output_0 /backbone/stage3/block5/Add_output_0_splitncnn_0 /backbone/stage3/block5/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block6/conv1/Split 1 2 /backbone/stage3/block5/Add_output_0_splitncnn_1 /backbone/stage3/block6/conv1/Split_output_0 /backbone/stage3/block6/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block6/conv1/conv/Conv 1 1 /backbone/stage3/block6/conv1/Split_output_0 /backbone/stage3/block6/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block6/conv1/Concat 2 1 /backbone/stage3/block6/conv1/conv/Conv_output_0 /backbone/stage3/block6/conv1/Split_output_1 /backbone/stage3/block6/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block6/conv2/conv/Conv 1 1 /backbone/stage3/block6/conv1/Concat_output_0 /backbone/stage3/block6/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_22             1 2 /backbone/stage3/block6/conv2/conv/Conv_output_0 /backbone/stage3/block6/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block6/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block6/conv2/act/Div 1 1 /backbone/stage3/block6/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block6/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block6/conv2/act/Erf 1 1 /backbone/stage3/block6/conv2/act/Div_output_0 /backbone/stage3/block6/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block6/conv2/act/Add 1 1 /backbone/stage3/block6/conv2/act/Erf_output_0 /backbone/stage3/block6/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block6/conv2/act/Mul 2 1 /backbone/stage3/block6/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block6/conv2/act/Add_output_0 /backbone/stage3/block6/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block6/conv2/act/Mul_1 1 1 /backbone/stage3/block6/conv2/act/Mul_output_0 /backbone/stage3/block6/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block6/conv3/Conv 1 1 /backbone/stage3/block6/conv2/act/Mul_1_output_0 /backbone/stage3/block6/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block6/Add 2 1 /backbone/stage3/block5/Add_output_0_splitncnn_0 /backbone/stage3/block6/conv3/Conv_output_0 /backbone/stage3/block6/Add_output_0 0=0
Split            splitncnn_23             1 2 /backbone/stage3/block6/Add_output_0 /backbone/stage3/block6/Add_output_0_splitncnn_0 /backbone/stage3/block6/Add_output_0_splitncnn_1
Slice            /backbone/stage3/block7/conv1/Split 1 2 /backbone/stage3/block6/Add_output_0_splitncnn_1 /backbone/stage3/block7/conv1/Split_output_0 /backbone/stage3/block7/conv1/Split_output_1 -23300=2,40,-233 1=0
Convolution      /backbone/stage3/block7/conv1/conv/Conv 1 1 /backbone/stage3/block7/conv1/Split_output_0 /backbone/stage3/block7/conv1/conv/Conv_output_0 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=14400
Concat           /backbone/stage3/block7/conv1/Concat 2 1 /backbone/stage3/block7/conv1/conv/Conv_output_0 /backbone/stage3/block7/conv1/Split_output_1 /backbone/stage3/block7/conv1/Concat_output_0 0=0
Convolution      /backbone/stage3/block7/conv2/conv/Conv 1 1 /backbone/stage3/block7/conv1/Concat_output_0 /backbone/stage3/block7/conv2/conv/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Split            splitncnn_24             1 2 /backbone/stage3/block7/conv2/conv/Conv_output_0 /backbone/stage3/block7/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block7/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage3/block7/conv2/act/Div 1 1 /backbone/stage3/block7/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage3/block7/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage3/block7/conv2/act/Erf 1 1 /backbone/stage3/block7/conv2/act/Div_output_0 /backbone/stage3/block7/conv2/act/Erf_output_0
BinaryOp         /backbone/stage3/block7/conv2/act/Add 1 1 /backbone/stage3/block7/conv2/act/Erf_output_0 /backbone/stage3/block7/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage3/block7/conv2/act/Mul 2 1 /backbone/stage3/block7/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage3/block7/conv2/act/Add_output_0 /backbone/stage3/block7/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage3/block7/conv2/act/Mul_1 1 1 /backbone/stage3/block7/conv2/act/Mul_output_0 /backbone/stage3/block7/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage3/block7/conv3/Conv 1 1 /backbone/stage3/block7/conv2/act/Mul_1_output_0 /backbone/stage3/block7/conv3/Conv_output_0 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=51200
BinaryOp         /backbone/stage3/block7/Add 2 1 /backbone/stage3/block6/Add_output_0_splitncnn_0 /backbone/stage3/block7/conv3/Conv_output_0 /backbone/stage3/block7/Add_output_0 0=0
Split            splitncnn_25             1 2 /backbone/stage3/block7/Add_output_0 /backbone/stage3/block7/Add_output_0_splitncnn_0 /backbone/stage3/block7/Add_output_0_splitncnn_1
Convolution      /backbone/merging3/conv/Conv 1 1 /backbone/stage3/block7/Add_output_0_splitncnn_1 /backbone/merging3/conv/Conv_output_0 0=320 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=204800
ReLU             /backbone/merging3/act/Relu 1 1 /backbone/merging3/conv/Conv_output_0 /backbone/merging3/act/Relu_output_0
Split            splitncnn_26             1 2 /backbone/merging3/act/Relu_output_0 /backbone/merging3/act/Relu_output_0_splitncnn_0 /backbone/merging3/act/Relu_output_0_splitncnn_1
Pooling          /backbone/se3/globalavgpool/GlobalAveragePool 1 1 /backbone/merging3/act/Relu_output_0_splitncnn_1 /backbone/se3/globalavgpool/GlobalAveragePool_output_0 0=1 4=1
Reshape          /backbone/se3/Reshape    1 1 /backbone/se3/globalavgpool/GlobalAveragePool_output_0 /backbone/se3/Reshape_output_0 0=320
InnerProduct     /backbone/se3/fc/fc.0/Gemm 1 1 /backbone/se3/Reshape_output_0 /backbone/se3/fc/fc.0/Gemm_output_0 0=20 1=1 2=6400
ReLU             /backbone/se3/fc/fc.1/Relu 1 1 /backbone/se3/fc/fc.0/Gemm_output_0 /backbone/se3/fc/fc.1/Relu_output_0
InnerProduct     /backbone/se3/fc/fc.2/Gemm 1 1 /backbone/se3/fc/fc.1/Relu_output_0 /backbone/se3/fc/fc.2/Gemm_output_0 0=320 1=1 2=6400
Sigmoid          /backbone/se3/fc/fc.3/Sigmoid 1 1 /backbone/se3/fc/fc.2/Gemm_output_0 /backbone/se3/fc/fc.3/Sigmoid_output_0
Reshape          /backbone/se3/Reshape_1  1 1 /backbone/se3/fc/fc.3/Sigmoid_output_0 /backbone/se3/Reshape_1_output_0 0=1 1=1 2=320
BinaryOp         /backbone/se3/Mul        2 1 /backbone/merging3/act/Relu_output_0_splitncnn_0 /backbone/se3/Reshape_1_output_0 /backbone/se3/Mul_output_0 0=2
Split            splitncnn_27             1 2 /backbone/se3/Mul_output_0 /backbone/se3/Mul_output_0_splitncnn_0 /backbone/se3/Mul_output_0_splitncnn_1
Slice            /backbone/stage4/block0/conv1/Split 1 2 /backbone/se3/Mul_output_0_splitncnn_1 /backbone/stage4/block0/conv1/Split_output_0 /backbone/stage4/block0/conv1/Split_output_1 -23300=2,80,-233 1=0
Convolution      /backbone/stage4/block0/conv1/conv/Conv 1 1 /backbone/stage4/block0/conv1/Split_output_0 /backbone/stage4/block0/conv1/conv/Conv_output_0 0=80 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=57600
Concat           /backbone/stage4/block0/conv1/Concat 2 1 /backbone/stage4/block0/conv1/conv/Conv_output_0 /backbone/stage4/block0/conv1/Split_output_1 /backbone/stage4/block0/conv1/Concat_output_0 0=0
Convolution      /backbone/stage4/block0/conv2/conv/Conv 1 1 /backbone/stage4/block0/conv1/Concat_output_0 /backbone/stage4/block0/conv2/conv/Conv_output_0 0=640 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=204800
Split            splitncnn_28             1 2 /backbone/stage4/block0/conv2/conv/Conv_output_0 /backbone/stage4/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage4/block0/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage4/block0/conv2/act/Div 1 1 /backbone/stage4/block0/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage4/block0/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage4/block0/conv2/act/Erf 1 1 /backbone/stage4/block0/conv2/act/Div_output_0 /backbone/stage4/block0/conv2/act/Erf_output_0
BinaryOp         /backbone/stage4/block0/conv2/act/Add 1 1 /backbone/stage4/block0/conv2/act/Erf_output_0 /backbone/stage4/block0/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage4/block0/conv2/act/Mul 2 1 /backbone/stage4/block0/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage4/block0/conv2/act/Add_output_0 /backbone/stage4/block0/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage4/block0/conv2/act/Mul_1 1 1 /backbone/stage4/block0/conv2/act/Mul_output_0 /backbone/stage4/block0/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage4/block0/conv3/Conv 1 1 /backbone/stage4/block0/conv2/act/Mul_1_output_0 /backbone/stage4/block0/conv3/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=204800
BinaryOp         /backbone/stage4/block0/Add 2 1 /backbone/se3/Mul_output_0_splitncnn_0 /backbone/stage4/block0/conv3/Conv_output_0 /backbone/stage4/block0/Add_output_0 0=0
Split            splitncnn_29             1 2 /backbone/stage4/block0/Add_output_0 /backbone/stage4/block0/Add_output_0_splitncnn_0 /backbone/stage4/block0/Add_output_0_splitncnn_1
Slice            /backbone/stage4/block1/conv1/Split 1 2 /backbone/stage4/block0/Add_output_0_splitncnn_1 /backbone/stage4/block1/conv1/Split_output_0 /backbone/stage4/block1/conv1/Split_output_1 -23300=2,80,-233 1=0
Convolution      /backbone/stage4/block1/conv1/conv/Conv 1 1 /backbone/stage4/block1/conv1/Split_output_0 /backbone/stage4/block1/conv1/conv/Conv_output_0 0=80 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=57600
Concat           /backbone/stage4/block1/conv1/Concat 2 1 /backbone/stage4/block1/conv1/conv/Conv_output_0 /backbone/stage4/block1/conv1/Split_output_1 /backbone/stage4/block1/conv1/Concat_output_0 0=0
Convolution      /backbone/stage4/block1/conv2/conv/Conv 1 1 /backbone/stage4/block1/conv1/Concat_output_0 /backbone/stage4/block1/conv2/conv/Conv_output_0 0=640 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=204800
Split            splitncnn_30             1 2 /backbone/stage4/block1/conv2/conv/Conv_output_0 /backbone/stage4/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage4/block1/conv2/conv/Conv_output_0_splitncnn_1
BinaryOp         /backbone/stage4/block1/conv2/act/Div 1 1 /backbone/stage4/block1/conv2/conv/Conv_output_0_splitncnn_1 /backbone/stage4/block1/conv2/act/Div_output_0 0=3 1=1 2=1.414214e+00
Erf              /backbone/stage4/block1/conv2/act/Erf 1 1 /backbone/stage4/block1/conv2/act/Div_output_0 /backbone/stage4/block1/conv2/act/Erf_output_0
BinaryOp         /backbone/stage4/block1/conv2/act/Add 1 1 /backbone/stage4/block1/conv2/act/Erf_output_0 /backbone/stage4/block1/conv2/act/Add_output_0 0=0 1=1 2=1.000000e+00
BinaryOp         /backbone/stage4/block1/conv2/act/Mul 2 1 /backbone/stage4/block1/conv2/conv/Conv_output_0_splitncnn_0 /backbone/stage4/block1/conv2/act/Add_output_0 /backbone/stage4/block1/conv2/act/Mul_output_0 0=2
BinaryOp         /backbone/stage4/block1/conv2/act/Mul_1 1 1 /backbone/stage4/block1/conv2/act/Mul_output_0 /backbone/stage4/block1/conv2/act/Mul_1_output_0 0=2 1=1 2=5.000000e-01
Convolution      /backbone/stage4/block1/conv3/Conv 1 1 /backbone/stage4/block1/conv2/act/Mul_1_output_0 /backbone/stage4/block1/conv3/Conv_output_0 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=204800
BinaryOp         /backbone/stage4/block1/Add 2 1 /backbone/stage4/block0/Add_output_0_splitncnn_0 /backbone/stage4/block1/conv3/Conv_output_0 /backbone/stage4/block1/Add_output_0 0=0
Convolution      /neck/reduce_layers.0/conv/Conv 1 1 /backbone/stage2/block1/Add_output_0_splitncnn_0 /neck/reduce_layers.0/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10240
ReLU             /neck/reduce_layers.0/act/Relu 1 1 /neck/reduce_layers.0/conv/Conv_output_0 /neck/reduce_layers.0/act/Relu_output_0
Convolution      /neck/reduce_layers.1/conv/Conv 1 1 /backbone/stage3/block7/Add_output_0_splitncnn_0 /neck/reduce_layers.1/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20480
ReLU             /neck/reduce_layers.1/act/Relu 1 1 /neck/reduce_layers.1/conv/Conv_output_0 /neck/reduce_layers.1/act/Relu_output_0
Convolution      /neck/reduce_layers.2/conv/Conv 1 1 /backbone/stage4/block1/Add_output_0 /neck/reduce_layers.2/conv/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=40960
ReLU             /neck/reduce_layers.2/act/Relu 1 1 /neck/reduce_layers.2/conv/Conv_output_0 /neck/reduce_layers.2/act/Relu_output_0
Split            splitncnn_31             1 2 /neck/reduce_layers.2/act/Relu_output_0 /neck/reduce_layers.2/act/Relu_output_0_splitncnn_0 /neck/reduce_layers.2/act/Relu_output_0_splitncnn_1
Interp           /neck/upsample/Resize    1 1 /neck/reduce_layers.2/act/Relu_output_0_splitncnn_1 /neck/upsample/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           /neck/Concat             2 1 /neck/upsample/Resize_output_0 /neck/reduce_layers.1/act/Relu_output_0 /neck/Concat_output_0 0=0
Split            splitncnn_32             1 2 /neck/Concat_output_0 /neck/Concat_output_0_splitncnn_0 /neck/Concat_output_0_splitncnn_1
Convolution      /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv 1 1 /neck/Concat_output_0_splitncnn_1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu 1 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0
Split            splitncnn_33             1 2 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_1
ConvolutionDepthWise /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv 1 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu 1 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu_output_0
Concat           /neck/top_down_blocks.0/blocks/blocks.0/ghost1/Concat 2 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/Concat_output_0 0=0
Convolution      /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv 1 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost1/Concat_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Split            splitncnn_34             1 2 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_1
ConvolutionDepthWise /neck/top_down_blocks.0/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv 1 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_1 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Concat           /neck/top_down_blocks.0/blocks/blocks.0/ghost2/Concat 2 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/Concat_output_0 0=0
ConvolutionDepthWise /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.0/Conv 1 1 /neck/Concat_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.0/Conv_output_0 0=256 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6400 7=256
Convolution      /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.2/Conv 1 1 /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.0/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.2/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         /neck/top_down_blocks.0/blocks/blocks.0/Add 2 1 /neck/top_down_blocks.0/blocks/blocks.0/ghost2/Concat_output_0 /neck/top_down_blocks.0/blocks/blocks.0/shortcut/shortcut.2/Conv_output_0 /neck/top_down_blocks.0/blocks/blocks.0/Add_output_0 0=0
Split            splitncnn_35             1 2 /neck/top_down_blocks.0/blocks/blocks.0/Add_output_0 /neck/top_down_blocks.0/blocks/blocks.0/Add_output_0_splitncnn_0 /neck/top_down_blocks.0/blocks/blocks.0/Add_output_0_splitncnn_1
Interp           /neck/upsample_1/Resize  1 1 /neck/top_down_blocks.0/blocks/blocks.0/Add_output_0_splitncnn_1 /neck/upsample_1/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           /neck/Concat_1           2 1 /neck/upsample_1/Resize_output_0 /neck/reduce_layers.0/act/Relu_output_0 /neck/Concat_1_output_0 0=0
Split            splitncnn_36             1 2 /neck/Concat_1_output_0 /neck/Concat_1_output_0_splitncnn_0 /neck/Concat_1_output_0_splitncnn_1
Convolution      /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv 1 1 /neck/Concat_1_output_0_splitncnn_1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu 1 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.0/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0
Split            splitncnn_37             1 2 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_1
ConvolutionDepthWise /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv 1 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu 1 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.0/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu_output_0
Concat           /neck/top_down_blocks.1/blocks/blocks.0/ghost1/Concat 2 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/primary_conv/primary_conv.2/Relu_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/cheap_operation/cheap_operation.2/Relu_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/Concat_output_0 0=0
Convolution      /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv 1 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost1/Concat_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Split            splitncnn_38             1 2 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_1
ConvolutionDepthWise /neck/top_down_blocks.1/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv 1 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_1 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Concat           /neck/top_down_blocks.1/blocks/blocks.0/ghost2/Concat 2 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/primary_conv/primary_conv.0/Conv_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/cheap_operation/cheap_operation.0/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/Concat_output_0 0=0
ConvolutionDepthWise /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.0/Conv 1 1 /neck/Concat_1_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.0/Conv_output_0 0=256 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6400 7=256
Convolution      /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.2/Conv 1 1 /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.0/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.2/Conv_output_0 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         /neck/top_down_blocks.1/blocks/blocks.0/Add 2 1 /neck/top_down_blocks.1/blocks/blocks.0/ghost2/Concat_output_0 /neck/top_down_blocks.1/blocks/blocks.0/shortcut/shortcut.2/Conv_output_0 /neck/top_down_blocks.1/blocks/blocks.0/Add_output_0 0=0
Split            splitncnn_39             1 2 /neck/top_down_blocks.1/blocks/blocks.0/Add_output_0 /neck/top_down_blocks.1/blocks/blocks.0/Add_output_0_splitncnn_0 /neck/top_down_blocks.1/blocks/blocks.0/Add_output_0_splitncnn_1
ConvolutionDepthWise /neck/downsamples.0/dconv/conv/Conv 1 1 /neck/top_down_blocks.1/blocks/blocks.0/Add_output_0_splitncnn_1 /neck/downsamples.0/dconv/conv/Conv_output_0 0=128 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=3200 7=128
